

# Клиент
# - юсер
# - монеты (инт)
# - рубли (децимал)
# * аукционы
# * ставки на аукционах
# * переводы
# * товары биржи
# * покупки биржи
# * выставленные QIWI счета
# > регистрация
# > авторизация
# > лог аут

# Аукцион
# - кем начат (клиент, или сервер)
# - название
# - мд описание
# - дата начала
# - дата окончания
# - начальная ставка
# - статус
# * ставки

# Ставка
# - аукцион
# - клиент
# - сумма
# - дата

# Перевод
# - от кого (клиент)
# - кому (клиент)
# - сумма
# - дата

# Товар биржи
# - клиент
# - статус
# - дата создания
# - изначальная сумма монет
# - оставшаяся сумма монет
# - полученная сумма рублей
# - требуемая сумма рублей
# * покупки биржи

# Покупка бирже
# - продавец (клиент)
# - покупатель (клиент)
# - товар (товар биржи)
# - сумма купленных монет
# - сумма потраченных рублей
# - дата

# QIWI счет
# - кому выставили (клиент)
# - дата создания
# - дата окончания
# - сумма
# - айди счета (строка)
# - статус (из киви)

# Запрос на вывод средств
# - клиент
# - сумма рублей
# - дата
# - статус
# - дата перевода
